Repository: chiba233/SimpleZip
Catalog: SimpleZipIntentsExtension/Localizable.xcstrings
Source language: en
Languages: de, es, fr, ja, ko, ru, th, zh_hans, zh_hant

source: A fast, name-only check of a release folder's composition. Returns true when a downloader could verify it (an artifact or container plus SHA256SUMS).
de: Eine schnelle, rein namensbasierte Prüfung der Zusammensetzung eines Release-Ordners. Gibt „wahr“ zurück, wenn ein Downloader ihn verifizieren könnte (ein Artefakt oder Container plus SHA256SUMS).
es: Comprobación rápida, solo por nombre, de la composición de una carpeta de publicación. Devuelve verdadero cuando alguien que la descargue podría verificarla (un artefacto o contenedor más SHA256SUMS).
fr: Vérification rapide, basée uniquement sur les noms, de la composition d’un dossier de publication. Renvoie vrai si un utilisateur pourrait le vérifier (un artefact ou conteneur plus SHA256SUMS).
ja: リリースフォルダの構成を名前だけで素早く確認します。ダウンロードした人が検証できる状態(成果物またはコンテナ+SHA256SUMS)なら true を返します。
ko: 릴리스 폴더 구성을 이름만으로 빠르게 확인합니다. 내려받은 사람이 검증할 수 있으면(산출물 또는 컨테이너 + SHA256SUMS) true를 반환합니다.
ru: Быстрая проверка состава папки релиза только по именам. Возвращает true, если скачавший сможет её проверить (артефакт или контейнер плюс SHA256SUMS).
th: ตรวจองค์ประกอบของโฟลเดอร์รีลีสอย่างรวดเร็วโดยดูแค่ชื่อ คืนค่า true เมื่อผู้ดาวน์โหลดสามารถตรวจสอบได้ (มีไฟล์ผลลัพธ์หรือคอนเทนเนอร์ พร้อม SHA256SUMS)
zh_hans: 只按文件名快速核对发布目录的组成。当下载者能据此校验(有产物或容器 + SHA256SUMS)时返回真。
zh_hant: 只按檔名快速核對發佈目錄的組成。當下載者能據此校驗(有產物或容器 + SHA256SUMS)時回傳真。

source: Algorithm
de: Algorithmus
es: Algoritmo
fr: Algorithme
ja: アルゴリズム
ko: 알고리즘
ru: Алгоритм
th: อัลกอริทึม
zh_hans: 算法
zh_hant: 演算法

source: Analyze Archive Space
de: Archivspeicher analysieren
es: Analizar espacio del archivo
fr: Analyser l’espace de l’archive
ja: アーカイブの容量を分析
ko: 아카이브 공간 분석
ru: Анализ места в архиве
th: วิเคราะห์พื้นที่ของไฟล์บีบอัด
zh_hans: 分析归档空间占用
zh_hant: 分析歸檔空間佔用

source: Analyze archive space with ${applicationName}
de: Archivspeicher mit ${applicationName} analysieren
es: Analizar el espacio del archivo con ${applicationName}
fr: Analyser l'espace d'une archive avec ${applicationName}
ja: ${applicationName} でアーカイブの容量を分析
ko: ${applicationName}으로 아카이브 공간 분석
ru: Проанализировать размер архива в ${applicationName}
th: วิเคราะห์พื้นที่ของไฟล์บีบอัดด้วย ${applicationName}
zh_hans: 用 ${applicationName} 分析归档空间
zh_hant: 用 ${applicationName} 分析壓縮檔空間

source: Analyze the space used by ${archive}
de: Von ${archive} belegten Speicher analysieren
es: Analizar el espacio usado por ${archive}
fr: Analyser l’espace utilisé par ${archive}
ja: ${archive} が使う容量を分析
ko: ${archive}이(가) 사용하는 공간 분석
ru: Проанализировать место, занятое ${archive}
th: วิเคราะห์พื้นที่ที่ ${archive} ใช้
zh_hans: 分析 ${archive} 占用的空间
zh_hant: 分析 ${archive} 佔用的空間

source: Archive
de: Archiv
es: Archivo
ja: アーカイブ
ko: 아카이브
ru: Архив
th: ไฟล์เก็บถาวร
zh_hans: 归档
zh_hant: 歸檔

source: Archive Format
de: Archivformat
es: Formato del archivo
fr: Format de l’archive
ja: アーカイブ形式
ko: 아카이브 형식
ru: Формат архива
th: รูปแบบไฟล์เก็บถาวร
zh_hans: 归档格式
zh_hant: 歸檔格式

source: Archive Name
de: Archivname
es: Nombre del archivo
fr: Nom de l’archive
ja: アーカイブ名
ko: 아카이브 이름
ru: Имя архива
th: ชื่อไฟล์เก็บถาวร
zh_hans: 归档名称
zh_hant: 歸檔名稱

source: Archives
de: Archive
es: Archivos
ja: アーカイブ
ko: 아카이브
ru: Архивы
th: ไฟล์เก็บถาวร
zh_hans: 归档
zh_hant: 歸檔

source: Audit Release Directory
de: Release-Verzeichnis prüfen
es: Auditar directorio de publicación
fr: Auditer le dossier de publication
ja: リリースディレクトリを監査
ko: 릴리스 디렉터리 감사
ru: Проверить каталог релиза
th: ตรวจสอบไดเรกทอรีรีลีส
zh_hans: 检查发布包目录
zh_hant: 檢查發佈套件目錄

source: Audit release directory ${folder}
de: Release-Verzeichnis ${folder} prüfen
es: Auditar el directorio de publicación ${folder}
fr: Auditer le dossier de publication ${folder}
ja: リリースディレクトリ ${folder} を監査
ko: 릴리스 디렉터리 ${folder} 감사
ru: Проверить каталог релиза ${folder}
th: ตรวจสอบไดเรกทอรีรีลีส ${folder}
zh_hans: 检查发布目录 ${folder}
zh_hant: 檢查發佈目錄 ${folder}

source: Audits a release folder by name + checksum file (no hashing): checks SHA256SUMS coverage. Returns true when every artifact is covered by a checksum.
de: Prüft einen Release-Ordner anhand von Namen und Prüfsummendatei (ohne Hashing): kontrolliert die SHA256SUMS-Abdeckung. Gibt „wahr“ zurück, wenn jedes Artefakt durch eine Prüfsumme abgedeckt ist.
es: Audita una carpeta de publicación por nombre y archivo de sumas (sin hashing): comprueba la cobertura de SHA256SUMS. Devuelve verdadero cuando cada artefacto tiene su suma de comprobación.
fr: Audite un dossier de publication par nom et fichier de sommes (sans hachage) : vérifie la couverture SHA256SUMS. Renvoie vrai si chaque artefact est couvert par une somme de contrôle.
ja: リリースフォルダを名前とチェックサムファイルで監査します(ハッシュ計算なし):SHA256SUMS の網羅状況を確認します。すべての成果物がチェックサムでカバーされていれば true を返します。
ko: 릴리스 폴더를 이름과 체크섬 파일로 감사합니다(해시 계산 없음): SHA256SUMS 커버리지를 확인합니다. 모든 산출물이 체크섬으로 덮이면 true를 반환합니다.
ru: Проверяет папку релиза по именам и файлу контрольных сумм (без хеширования): анализирует покрытие SHA256SUMS. Возвращает true, если каждый артефакт покрыт контрольной суммой.
th: ตรวจสอบโฟลเดอร์รีลีสด้วยชื่อและไฟล์เช็คซัม (ไม่คำนวณแฮช): ตรวจความครอบคลุมของ SHA256SUMS คืนค่า true เมื่อทุกไฟล์ผลลัพธ์มีเช็คซัมครบ
zh_hans: 按文件名 + 校验文件审计发布目录(不算哈希):检查 SHA256SUMS 覆盖。每个产物都有校验时返回真。
zh_hant: 按檔名 + 校驗檔審計發佈目錄(不算雜湊):檢查 SHA256SUMS 覆蓋。每個產物都有校驗時回傳真。

source: Best-effort recovery from a damaged archive into a new "(rescued)" folder next to it. Rescued files may be incomplete and the archive is not repaired. Returns the rescue folder.
de: Bestmögliche Wiederherstellung aus einem beschädigten Archiv in einen neuen Ordner „(rescued)“ daneben. Gerettete Dateien können unvollständig sein, das Archiv wird nicht repariert. Gibt den Rettungsordner zurück.
es: Recuperación de mejor esfuerzo de un archivo dañado en una nueva carpeta «(rescued)» junto a él. Los archivos rescatados pueden estar incompletos y el archivo no se repara. Devuelve la carpeta de rescate.
fr: Récupération au mieux d’une archive endommagée dans un nouveau dossier « (rescued) » à côté. Les fichiers récupérés peuvent être incomplets et l’archive n’est pas réparée. Renvoie le dossier de récupération.
ja: 破損したアーカイブから可能な限り救出し、隣に新しい「(rescued)」フォルダを作成します。救出ファイルは不完全な場合があり、アーカイブ自体は修復されません。救出フォルダを返します。
ko: 손상된 아카이브에서 가능한 만큼 복구하여 옆에 새 "(rescued)" 폴더를 만듭니다. 복구된 파일은 불완전할 수 있고 아카이브는 복구되지 않습니다. 복구 폴더를 반환합니다.
ru: Восстанавливает по возможности данные из повреждённого архива в новую папку «(rescued)» рядом с ним. Восстановленные файлы могут быть неполными, сам архив не чинится. Возвращает папку восстановления.
th: กู้ข้อมูลจากไฟล์บีบอัดที่เสียหายให้ได้มากที่สุดไปยังโฟลเดอร์ใหม่ "(rescued)" ข้าง ๆ ไฟล์ที่กู้ได้อาจไม่สมบูรณ์และไม่ได้ซ่อมไฟล์บีบอัด คืนค่าโฟลเดอร์ที่กู้
zh_hans: 尽力从损坏的归档中救出数据到旁边新建的「(rescued)」文件夹。救出的文件可能不完整,且不会修复归档本身。返回该救援文件夹。
zh_hant: 盡力從損壞的歸檔中救出資料到旁邊新建的「(rescued)」資料夾。救出的檔案可能不完整,且不會修復歸檔本身。回傳該救援資料夾。

source: Check ${folder} packs reproducibly as ${format}
de: Prüfen, ob ${folder} reproduzierbar als ${format} gepackt wird
es: Comprobar si ${folder} se empaqueta de forma reproducible como ${format}
fr: Vérifier que ${folder} s’empaquette de façon reproductible en ${format}
ja: ${folder} が ${format} で再現性よくパッケージされるか確認
ko: ${folder}이(가) ${format}(으)로 재현 가능하게 패킹되는지 확인
ru: Проверить, упаковывается ли ${folder} воспроизводимо в ${format}
th: ตรวจว่า ${folder} แพ็กเป็น ${format} แบบทำซ้ำได้หรือไม่
zh_hans: 检查 ${folder} 是否能以 ${format} 可复现打包
zh_hant: 檢查 ${folder} 是否能以 ${format} 可重現打包

source: Check an archive with ${applicationName}
de: Ein Archiv mit ${applicationName} prüfen
es: Comprobar un archivo con ${applicationName}
fr: Vérifier une archive avec ${applicationName}
ja: ${applicationName} でアーカイブをチェック
ko: ${applicationName}(으)로 아카이브 점검
ru: Проверить архив через ${applicationName}
th: ตรวจไฟล์เก็บถาวรด้วย ${applicationName}
zh_hans: 用 ${applicationName} 检测归档
zh_hant: 用 ${applicationName} 檢測歸檔

source: Check Reproducible Packing
de: Reproduzierbares Packen prüfen
es: Comprobar empaquetado reproducible
fr: Vérifier l’empaquetage reproductible
ja: 再現性のあるパッケージを確認
ko: 재현 가능한 패킹 확인
ru: Проверить воспроизводимость упаковки
th: ตรวจการแพ็กแบบทำซ้ำได้
zh_hans: 检查可复现打包
zh_hant: 檢查可重現打包

source: Check up ${archives}
de: ${archives} durchchecken
es: Revisar ${archives}
fr: Faire le bilan de ${archives}
ja: ${archives} を点検
ko: ${archives} 점검
ru: Проверить ${archives}
th: ตรวจสุขภาพ ${archives}
zh_hans: 体检 ${archives}
zh_hant: 體檢 ${archives}

source: Check Up Archives
de: Archive durchchecken
es: Revisar archivos
fr: Bilan des archives
ja: アーカイブを一括点検
ko: 아카이브 일괄 점검
ru: Проверка архивов
th: ตรวจสุขภาพไฟล์บีบอัด
zh_hans: 批量体检归档
zh_hant: 批次體檢歸檔

source: Check up archives with ${applicationName}
de: Archive mit ${applicationName} überprüfen
es: Revisar archivos comprimidos con ${applicationName}
fr: Vérifier des archives avec ${applicationName}
ja: ${applicationName} でアーカイブを点検
ko: ${applicationName}으로 아카이브 점검
ru: Проверить архивы в ${applicationName}
th: ตรวจสุขภาพไฟล์บีบอัดด้วย ${applicationName}
zh_hans: 用 ${applicationName} 体检归档
zh_hant: 用 ${applicationName} 體檢壓縮檔

source: Checksum Files
de: Prüfsummendateien
es: Archivos de suma de comprobación
fr: Fichiers de sommes de contrôle
ja: チェックサムファイル
ko: 체크섬 파일
ru: Файлы контрольных сумм
th: ไฟล์เช็คซัม
zh_hans: 校验和文件
zh_hant: 校驗和檔案

source: Compare ${left} with ${right}
de: ${left} mit ${right} vergleichen
es: Comparar ${left} con ${right}
fr: Comparer ${left} avec ${right}
ja: ${left} と ${right} を比較
ko: ${left}과(와) ${right} 비교
ru: Сравнить ${left} с ${right}
th: เปรียบเทียบ ${left} กับ ${right}
zh_hans: 比较 ${left} 与 ${right}
zh_hant: 比較 ${left} 與 ${right}

source: Compare Archives
de: Archive vergleichen
es: Comparar archivos
fr: Comparer les archives
ja: アーカイブを比較
ko: 아카이브 비교
ru: Сравнить архивы
th: เปรียบเทียบไฟล์เก็บถาวร
zh_hans: 比较归档
zh_hant: 比較歸檔

source: Compare archives with ${applicationName}
de: Archive mit ${applicationName} vergleichen
es: Comparar archivos con ${applicationName}
fr: Comparer des archives avec ${applicationName}
ja: ${applicationName} でアーカイブを比較
ko: ${applicationName}(으)로 아카이브 비교
ru: Сравнить архивы с помощью ${applicationName}
th: เปรียบเทียบไฟล์เก็บถาวรด้วย ${applicationName}
zh_hans: 用 ${applicationName} 比较归档
zh_hant: 用 ${applicationName} 比較歸檔

source: Compare two archives with ${applicationName}
de: Zwei Archive mit ${applicationName} vergleichen
es: Comparar dos archivos con ${applicationName}
fr: Comparer deux archives avec ${applicationName}
ja: ${applicationName} で2つのアーカイブを比較
ko: ${applicationName}(으)로 두 아카이브 비교
ru: Сравнить два архива с помощью ${applicationName}
th: เปรียบเทียบไฟล์เก็บถาวรสองไฟล์ด้วย ${applicationName}
zh_hans: 用 ${applicationName} 比较两个归档
zh_hant: 用 ${applicationName} 比較兩個歸檔

source: Compares the entry lists of two archives (path, size, CRC, modified, encryption). Returns true when they are identical.
de: Vergleicht die Eintragslisten zweier Archive (Pfad, Größe, CRC, Änderungsdatum, Verschlüsselung). Gibt „wahr“ zurück, wenn sie identisch sind.
es: Compara las listas de entradas de dos archivos (ruta, tamaño, CRC, modificación, cifrado). Devuelve verdadero cuando son idénticas.
fr: Compare les listes d’entrées de deux archives (chemin, taille, CRC, modification, chiffrement). Renvoie vrai si elles sont identiques.
ja: 2つのアーカイブのエントリ一覧(パス、サイズ、CRC、更新日時、暗号化)を比較します。同一なら true を返します。
ko: 두 아카이브의 항목 목록(경로, 크기, CRC, 수정일, 암호화)을 비교합니다. 동일하면 true를 반환합니다.
ru: Сравнивает списки записей двух архивов (путь, размер, CRC, дата изменения, шифрование). Возвращает true, если они идентичны.
th: เปรียบเทียบรายการเอนทรีของไฟล์บีบอัดสองไฟล์ (เส้นทาง ขนาด CRC วันที่แก้ไข การเข้ารหัส) คืนค่า true เมื่อเหมือนกันทุกประการ
zh_hans: 比较两个归档的条目清单(路径、大小、CRC、修改时间、加密)。完全相同时返回真。
zh_hant: 比較兩個歸檔的條目清單(路徑、大小、CRC、修改時間、加密)。完全相同時回傳真。

source: Compute File Hash
de: Datei-Hash berechnen
es: Calcular hash de archivo
fr: Calculer le hachage du fichier
ja: ファイルのハッシュを計算
ko: 파일 해시 계산
ru: Вычислить хеш файла
th: คำนวณแฮชของไฟล์
zh_hans: 计算文件哈希
zh_hant: 計算檔案雜湊

source: Compute the ${algorithm} of ${files}
de: ${algorithm} von ${files} berechnen
es: Calcular el ${algorithm} de ${files}
fr: Calculer le ${algorithm} de ${files}
ja: ${files} の ${algorithm} を計算
ko: ${files}의 ${algorithm} 계산
ru: Вычислить ${algorithm} для ${files}
th: คำนวณ ${algorithm} ของ ${files}
zh_hans: 计算 ${files} 的 ${algorithm}
zh_hant: 計算 ${files} 的 ${algorithm}

source: Computes a checksum (CRC32, MD5, SHA-1, SHA-256 or SHA-512) for one or more files. Returns the hex digests in the same order as the input files.
de: Berechnet eine Prüfsumme (CRC32, MD5, SHA-1, SHA-256 oder SHA-512) für eine oder mehrere Dateien. Gibt die Hex-Prüfsummen in der Reihenfolge der Eingabedateien zurück.
es: Calcula una suma de comprobación (CRC32, MD5, SHA-1, SHA-256 o SHA-512) de uno o varios archivos. Devuelve los hashes hexadecimales en el mismo orden que los archivos de entrada.
fr: Calcule une somme de contrôle (CRC32, MD5, SHA-1, SHA-256 ou SHA-512) pour un ou plusieurs fichiers. Renvoie les empreintes hexadécimales dans l’ordre des fichiers fournis.
ja: 1つ以上のファイルのチェックサム(CRC32 / MD5 / SHA-1 / SHA-256 / SHA-512)を計算し、入力と同じ順序で16進ダイジェストを返します。
ko: 하나 이상의 파일에 대해 체크섬(CRC32, MD5, SHA-1, SHA-256 또는 SHA-512)을 계산하고 입력 순서대로 16진수 다이제스트를 반환합니다.
ru: Вычисляет контрольную сумму (CRC32, MD5, SHA-1, SHA-256 или SHA-512) для одного или нескольких файлов и возвращает хеши в том же порядке, что и входные файлы.
th: คำนวณเช็คซัม (CRC32, MD5, SHA-1, SHA-256 หรือ SHA-512) ของไฟล์ตั้งแต่หนึ่งไฟล์ขึ้นไป และคืนค่าไดเจสต์เลขฐานสิบหกตามลำดับของไฟล์ที่ป้อน
zh_hans: 为一个或多个文件计算校验和(CRC32、MD5、SHA-1、SHA-256 或 SHA-512),按输入文件的顺序返回十六进制摘要。
zh_hant: 為一個或多個檔案計算校驗和(CRC32、MD5、SHA-1、SHA-256 或 SHA-512),依輸入檔案的順序回傳十六進位摘要。

source: Create a ${format} archive from ${files}
de: Ein ${format}-Archiv aus ${files} erstellen
es: Crear un archivo ${format} a partir de ${files}
fr: Créer une archive ${format} à partir de ${files}
ja: ${files} から ${format} アーカイブを作成
ko: ${files}에서 ${format} 아카이브 생성
ru: Создать ${format}-архив из ${files}
th: สร้างไฟล์เก็บถาวร ${format} จาก ${files}
zh_hans: 用 ${files} 创建 ${format} 归档
zh_hant: 用 ${files} 建立 ${format} 歸檔

source: Create an archive with ${applicationName}
de: Ein Archiv mit ${applicationName} erstellen
es: Crear un archivo con ${applicationName}
fr: Créer une archive avec ${applicationName}
ja: ${applicationName} でアーカイブを作成
ko: ${applicationName}(으)로 아카이브 생성
ru: Создать архив с помощью ${applicationName}
th: สร้างไฟล์เก็บถาวรด้วย ${applicationName}
zh_hans: 用 ${applicationName} 创建归档
zh_hant: 用 ${applicationName} 建立歸檔

source: Create Archive
de: Archiv erstellen
es: Crear archivo
fr: Créer une archive
ja: アーカイブを作成
ko: 아카이브 생성
ru: Создать архив
th: สร้างไฟล์เก็บถาวร
zh_hans: 创建归档
zh_hant: 建立歸檔

source: Creates an archive from files or folders that live in the same folder. The archive is written next to the inputs without overwriting any existing file.
de: Erstellt ein Archiv aus Dateien oder Ordnern im selben Ordner. Das Archiv wird neben den Eingaben abgelegt, ohne vorhandene Dateien zu überschreiben.
es: Crea un archivo comprimido a partir de archivos o carpetas que estén en la misma carpeta. El archivo se guarda junto a los originales sin sobrescribir ningún archivo existente.
fr: Crée une archive à partir de fichiers ou de dossiers situés dans le même dossier. L'archive est écrite à côté des éléments d'origine, sans écraser aucun fichier existant.
ja: 同じフォルダ内のファイルまたはフォルダからアーカイブを作成します。アーカイブは入力の隣に書き出され、既存のファイルを上書きしません。
ko: 같은 폴더에 있는 파일이나 폴더로 아카이브를 만듭니다. 아카이브는 입력 항목 옆에 기록되며 기존 파일을 덮어쓰지 않습니다.
ru: Создаёт архив из файлов или папок, находящихся в одной папке. Архив сохраняется рядом с исходными файлами и не перезаписывает существующие.
th: สร้างไฟล์บีบอัดจากไฟล์หรือโฟลเดอร์ที่อยู่ในโฟลเดอร์เดียวกัน ไฟล์บีบอัดจะถูกเขียนไว้ข้างๆ รายการต้นทางโดยไม่เขียนทับไฟล์ที่มีอยู่
zh_hans: 从同一文件夹内的文件或文件夹创建归档。归档写入到输入项旁边,绝不覆盖任何已有文件。
zh_hant: 從同一資料夾內的檔案或資料夾建立壓縮檔。壓縮檔寫入到輸入項旁邊,絕不覆寫任何既有檔案。

source: Destination Folder
de: Zielordner
es: Carpeta de destino
fr: Dossier de destination
ja: 保存先フォルダ
ko: 대상 폴더
ru: Папка назначения
th: โฟลเดอร์ปลายทาง
zh_hans: 目标文件夹
zh_hant: 目標資料夾

source: Extract ${archives} to ${destination}
de: ${archives} nach ${destination} entpacken
es: Extraer ${archives} en ${destination}
fr: Extraire ${archives} vers ${destination}
ja: ${archives} を ${destination} に展開
ko: ${archives}을(를) ${destination}에 추출
ru: Извлечь ${archives} в ${destination}
th: แตก ${archives} ไปที่ ${destination}
zh_hans: 将 ${archives} 解压到 ${destination}
zh_hant: 將 ${archives} 解壓到 ${destination}

source: Extract an archive with ${applicationName}
de: Ein Archiv mit ${applicationName} entpacken
es: Extraer un archivo con ${applicationName}
fr: Extraire une archive avec ${applicationName}
ja: ${applicationName} でアーカイブを展開
ko: ${applicationName}(으)로 아카이브 추출
ru: Извлечь архив с помощью ${applicationName}
th: แตกไฟล์เก็บถาวรด้วย ${applicationName}
zh_hans: 用 ${applicationName} 解压归档
zh_hant: 用 ${applicationName} 解壓歸檔

source: Extract Archive
de: Archiv entpacken
es: Extraer archivo
fr: Extraire l’archive
ja: アーカイブを展開
ko: 아카이브 추출
ru: Извлечь архив
th: แตกไฟล์เก็บถาวร
zh_hans: 解压归档
zh_hant: 解壓歸檔

source: Extracts archives the way SimpleZip's Finder auto-extract does: each archive unpacks into a uniquely named folder next to itself (or inside the chosen destination). Existing files are never overwritten.
de: Entpackt Archive wie die Finder-Auto-Entpackung von SimpleZip: Jedes Archiv wird in einen eindeutig benannten Ordner daneben (oder im gewählten Ziel) entpackt. Vorhandene Dateien werden nie überschrieben.
es: Extrae archivos igual que la extracción automática del Finder de SimpleZip: cada archivo se descomprime en una carpeta con nombre único junto a él (o dentro del destino elegido). Nunca se sobrescriben archivos existentes.
fr: Extrait les archives comme l’extraction automatique du Finder de SimpleZip : chaque archive est décompressée dans un dossier au nom unique à côté d’elle (ou dans la destination choisie). Les fichiers existants ne sont jamais écrasés.
ja: SimpleZip の Finder 自動解凍と同じ方法でアーカイブを展開します。各アーカイブは隣の一意な名前のフォルダ(または選んだ保存先)に展開され、既存ファイルは上書きされません。
ko: SimpleZip의 Finder 자동 압축 해제와 동일하게 아카이브를 풉니다. 각 아카이브는 옆의 고유한 이름의 폴더(또는 선택한 대상)에 풀리며 기존 파일은 절대 덮어쓰지 않습니다.
ru: Распаковывает архивы так же, как авто-распаковка SimpleZip в Finder: каждый архив распаковывается в папку с уникальным именем рядом с ним (или в выбранном месте). Существующие файлы никогда не перезаписываются.
th: แตกไฟล์บีบอัดแบบเดียวกับการแตกอัตโนมัติใน Finder ของ SimpleZip: แต่ละไฟล์จะถูกแตกไปยังโฟลเดอร์ชื่อไม่ซ้ำข้าง ๆ (หรือในปลายทางที่เลือก) และไม่เขียนทับไฟล์ที่มีอยู่
zh_hans: 按 SimpleZip 在 Finder 里自动解压的方式解压归档:每个归档解到旁边一个唯一命名的文件夹(或所选目标里),绝不覆盖已有文件。
zh_hant: 按 SimpleZip 在 Finder 裡自動解壓的方式解壓歸檔:每個歸檔解到旁邊一個唯一命名的資料夾(或所選目標裡),絕不覆寫既有檔案。

source: Files
de: Dateien
es: Archivos
fr: Fichiers
ja: ファイル
ko: 파일
ru: Файлы
th: ไฟล์
zh_hans: 文件
zh_hant: 檔案

source: Find Duplicate Archives
de: Doppelte Archive finden
es: Buscar archivos duplicados
fr: Trouver les archives en double
ja: 重複アーカイブを検索
ko: 중복 아카이브 찾기
ru: Найти дубликаты архивов
th: ค้นหาไฟล์บีบอัดที่ซ้ำกัน
zh_hans: 查找重复归档
zh_hant: 尋找重複歸檔

source: Find duplicates among ${archives}
de: Duplikate unter ${archives} finden
es: Buscar duplicados entre ${archives}
fr: Trouver les doublons parmi ${archives}
ja: ${archives} の中から重複を検索
ko: ${archives}에서 중복 찾기
ru: Найти дубликаты среди ${archives}
th: ค้นหารายการซ้ำใน ${archives}
zh_hans: 在 ${archives} 中查找重复项
zh_hant: 在 ${archives} 中尋找重複項

source: Finds duplicate archives among the given archives by structural fingerprint. Returns one line per duplicate group.
de: Findet doppelte Archive unter den angegebenen Archiven anhand des Strukturfingerabdrucks. Gibt pro Duplikatgruppe eine Zeile zurück.
es: Busca archivos duplicados entre los indicados mediante su huella estructural. Devuelve una línea por grupo de duplicados.
fr: Recherche les archives en double parmi celles fournies via leur empreinte structurelle. Renvoie une ligne par groupe de doublons.
ja: 指定したアーカイブの中から構造フィンガープリントで重複を見つけます。重複グループごとに1行を返します。
ko: 지정한 아카이브들 중에서 구조 지문으로 중복을 찾습니다. 중복 그룹마다 한 줄을 반환합니다.
ru: Находит дубликаты среди указанных архивов по структурному отпечатку. Возвращает по строке на каждую группу дубликатов.
th: ค้นหาไฟล์บีบอัดที่ซ้ำกันจากรายการที่ให้มาโดยใช้ลายนิ้วมือเชิงโครงสร้าง คืนค่าหนึ่งบรรทัดต่อหนึ่งกลุ่มที่ซ้ำ
zh_hans: 在给定的归档中按结构指纹查找重复归档,每个重复组返回一行。
zh_hant: 在給定的歸檔中按結構指紋尋找重複歸檔,每個重複組回傳一行。

source: First Archive
de: Erstes Archiv
es: Primer archivo
fr: Première archive
ja: 1つ目のアーカイブ
ko: 첫 번째 아카이브
ru: Первый архив
th: ไฟล์เก็บถาวรแรก
zh_hans: 第一个归档
zh_hant: 第一個歸檔

source: Folder
de: Ordner
es: Carpeta
fr: Dossier
ja: フォルダ
ko: 폴더
ru: Папка
th: โฟลเดอร์
zh_hans: 文件夹
zh_hant: 資料夾

source: Hash Algorithm
de: Hash-Algorithmus
es: Algoritmo de hash
fr: Algorithme de hachage
ja: ハッシュアルゴリズム
ko: 해시 알고리즘
ru: Алгоритм хеширования
th: อัลกอริทึมแฮช
zh_hans: 哈希算法
zh_hant: 雜湊演算法

source: Inspect ${archive}
de: ${archive} prüfen
es: Inspeccionar ${archive}
fr: Inspecter ${archive}
ja: ${archive} を検査
ko: ${archive} 검사
ru: Проверить ${archive}
th: ตรวจสอบ ${archive}
zh_hans: 检查 ${archive}
zh_hant: 檢查 ${archive}

source: Inspect an archive for release with ${applicationName}
de: Ein Archiv für die Veröffentlichung mit ${applicationName} prüfen
es: Inspeccionar un archivo para publicación con ${applicationName}
fr: Inspecter une archive pour publication avec ${applicationName}
ja: ${applicationName} でリリース用にアーカイブを検査
ko: ${applicationName}(으)로 릴리스용 아카이브 검사
ru: Проверить архив для релиза с помощью ${applicationName}
th: ตรวจสอบไฟล์เก็บถาวรสำหรับรีลีสด้วย ${applicationName}
zh_hans: 用 ${applicationName} 检查待发布的归档
zh_hant: 用 ${applicationName} 檢查待發佈的歸檔

source: Inspect an archive with ${applicationName}
de: Ein Archiv mit ${applicationName} prüfen
es: Inspeccionar un archivo con ${applicationName}
fr: Inspecter une archive avec ${applicationName}
ja: ${applicationName} でアーカイブを検査
ko: ${applicationName}(으)로 아카이브 검사
ru: Проверить архив с помощью ${applicationName}
th: ตรวจสอบไฟล์เก็บถาวรด้วย ${applicationName}
zh_hans: 用 ${applicationName} 检查归档
zh_hant: 用 ${applicationName} 檢查歸檔

source: Inspect Archive
de: Archiv prüfen
es: Inspeccionar archivo
fr: Inspecter l’archive
ja: アーカイブを検査
ko: 아카이브 검사
ru: Проверить архив
th: ตรวจสอบไฟล์เก็บถาวร
zh_hans: 检查归档
zh_hant: 檢查歸檔

source: Inspects an archive the way the Release Assistant does — file count, total size, macOS junk, empty directories and suspicious entry paths — without extracting. Returns true when nothing suspicious is found.
de: Untersucht ein Archiv wie der Release-Assistent — Dateianzahl, Gesamtgröße, macOS-Müll, leere Ordner und verdächtige Eintragspfade — ohne zu entpacken. Gibt „wahr“ zurück, wenn nichts Verdächtiges gefunden wird.
es: Inspecciona un archivo como el Asistente de publicación: número de archivos, tamaño total, basura de macOS, carpetas vacías y rutas de entrada sospechosas, sin extraer. Devuelve verdadero cuando no se encuentra nada sospechoso.
fr: Inspecte une archive comme l’Assistant de publication — nombre de fichiers, taille totale, fichiers indésirables macOS, dossiers vides et chemins d’entrée suspects — sans extraire. Renvoie vrai si rien de suspect n’est trouvé.
ja: リリースアシスタントと同じ方法でアーカイブを検査します(ファイル数、合計サイズ、macOS のゴミ、空フォルダ、疑わしいエントリパス)。展開はしません。疑わしいものがなければ true を返します。
ko: 릴리스 어시스턴트와 동일하게 아카이브를 검사합니다 — 파일 수, 총 크기, macOS 불필요 파일, 빈 폴더, 의심스러운 항목 경로 — 압축을 풀지 않습니다. 의심스러운 것이 없으면 true를 반환합니다.
ru: Проверяет архив так же, как Ассистент релиза, — число файлов, общий размер, мусор macOS, пустые папки и подозрительные пути записей — без распаковки. Возвращает true, если ничего подозрительного не найдено.
th: ตรวจสอบไฟล์บีบอัดแบบเดียวกับผู้ช่วยรีลีส — จำนวนไฟล์ ขนาดรวม ขยะ macOS โฟลเดอร์ว่าง และเส้นทางเอนทรีที่น่าสงสัย — โดยไม่แตกไฟล์ คืนค่า true เมื่อไม่พบสิ่งน่าสงสัย
zh_hans: 按发布助手的方式检查归档——文件数、总大小、macOS 垃圾、空目录和可疑条目路径——不解压。没有可疑项时返回真。
zh_hant: 按發佈助手的方式檢查歸檔——檔案數、總大小、macOS 垃圾、空目錄和可疑條目路徑——不解壓。沒有可疑項時回傳真。
